{
    "admission_info": "For BS admissions, please visit http://admissions.pieas.edu.pk/Admissions/BS.html. For MS admissions, visit http://admissions.pieas.edu.pk/Admissions/MS.html.",
    "courses_info": "PIEAS offers a variety of programs in Engineering, Computer Science, and Applied Sciences. You can find more details on the PIEAS website.",
    "contact_info": "You can contact the PIEAS administration at admin@pieas.edu.pk or call +92-51-111-11-PIEAS.",
    "gpa_info": "A student shall be required to maintain a minimum of 2.33 GPA in each semester. A student failing to maintain a minimum of 2.33 GPA in any semester shall be placed on probation. i) A student placed on probation, will take a course load of 9-12 credit hours in the next coming semester.",
    "good_info": "Pakistan Institute of Engineering and Applied Sciences (PIEAS) is one of the top public universities in Islamabad, Pakistan. It is ranked #691-700 in QS World University Rankings 2025.",
    "hostel_info": "PIEAS offers best accomodation. There are seven hostels for boys and one hostel for girls in Pieas while some are under construction. Hostel Accommodation Rs. 3,300/- per month for shared accommodation(if availing hostel accommodation at PIEAS). First semester fee should be deposited online in PIEAS University online account. Fee challan will be made available on admission portal to successful candidates.",
    "test_info": "PIEAS coductucts its entry test for more than once. Entry Test for BS Programs consists of 90 MCQs (with four answer choices) and the time allowed is two (02) hours i.e., 120 minutes. Note: Candidates are requested to read and understand the table carefully before making their choice in Section I and III.",
    "famous_info": "PIEAS's excellence was recognized on the national level when PIEAS was declared to be the best Engineering University in Pakistan by the Higher Education Commission (HEC) in its first ever ranking of universities in year 2006.",
    "last_info": "The last date to apply for admission was June 07,2024. For further details visit http://admissions.pieas.edu.pk/Admissions/schedule.html.",
    "merit_info": "Selection of candidates is made on the basis of Matric /O-level, F.Sc./A-level grades and written test as per following: PIEAS Written Test 60% Matric 15% F.Sc or F.Sc (Part I) 25%.",
    "rank_info": "Noteworthy: Sponsored by the Pakistan Atomic Energy Commission, PIEAS is a highly selective institution, ranked 397th worldwide and the best in Pakistan according to QS Rankings.",
    "fee_info": "The fee structure for various programs is available on the PIEAS website. Please visit the respective program page for detailed information.",
    "sat_info": "Admission shall be based on SAT II result of three subjects (Physics, Chemistry and Mathematics level II) or ACT score. The SAT score should be at least 2000 or more while ACT score should be at least 26. The PIEAS institutional code to receive SAT scores is 7272 and for ACT is 3783.",
    "location_info": "Nestled in the serene setting of a beautiful countryside, Pakistan Institute of Engineering and Applied Sciences (PIEAS), Islamabad, is recognized as a preeminent federal public university devoted to higher education in specific disciplines of engineering, natural sciences and formal sciences."

}

